{
   "activities" : {
      "eating_berries" : {
         "id" : "eating_berries",
         "trigger_policy" : [
            {
               "trigger_id" : "eating_berries",
               "probability" : 100
            }
         ],
         "text" : "On Eating Berries:",
         "type" : "random",
         "logs_by_personality" : {
            "beleaguered_leader" : {
               "logs" : [
               "Mmm, des aies! Ça fait partie d'une alimentation régulière pour rester en bonne santé.",
               "Des baies encore! Ce qui est bien parce que ça nous maintient en bonne santé.",
               "Des baies! Elles ont meilleur goût que celui de la famine.",
               "Avez vous mangé vos baies aujourd'hui? Je sais que moi je les ais mangé!",
               "Je me demande ce qui est prêt pour le dîner? Je sais--des BAIES!",
               "Tout le monde a l'air tellment bien de manger tant de baies. J'essaye d'être un bon exemple."
               ]
            },
            "hopeless_optimist" : {
               "logs" : [
               "Cool! Je peut manger toutes les baies fraiches que je veux! Je ne vais pas avoir faim aujourd'hui!",
               "J'adore quand les baies font devenir ma bouche bleu. Et ma langue. et mes entrailles. Et--",
               "Chaque baie a un goût différant. Un peu comme les flocons de neige, mais pour la bouche!",
               "Je suis vraiment bon pour savoir quelles baies sont mûr ou non." 
               ]
            },
            "lovable_rogue" : {
               "logs" : [
               "En théorie, vous pouvez faire fermenter les fruits, non? Par *__teacher__* les boissons fermentée me manquent.",
               "Je devrais arrêter d'essayer de voler ces baies pour les mettres dans mes poches. Si je garde ce pantalon, quelqu'un pourrait remarquer les grandes tâches pourpres dans mon pantalon."
               ]
            },
            "psychopathic_misanthrope" : {
               "logs" : [
               "Huh. Ces baies sont en fait un peu plus en train de grandir en moi. Elles ce goût frais et non fumé.",
               "Je ne suis pas sû. Ces baies font grandir en moi un peu de ... de bonheur. Je n'aime pas où cela va.",
               "Maintenant je sais pourquoi les hippies sont végétariens!"
               ]
            },
            "insufferable_academic" : {
               "logs" : [
               "Les baies de couleur foncée sont pleine d'antioxydants. C'est bon pour votre santé."
               ]
            },
            "diligent_sweetheart" : {
               "logs" : [
               "Mmm, des baies! Vous n'avez jamais des fruits frais dans cette ville.",
               "Si nous pouvions avoir un poêle en fer, je pourrais faire une tarte. Mais, je devrait avoir aussi du beurre. Et de la farine. Et du sucre.",
               "Ma silhouette semble superbe!"
               ]
            }
         }
      }
   }
}
            