{
   "activities" : {
      "foodless" : {
         "id" : "foodless",
         "trigger_policy" : [
            {
               "trigger_id" : "foodless",
               "probability" : 100
            }
         ],
         "text" : "N'ayant pas de nourriture:",
         "type" : "random",
         "logs_by_personality" : {
            "generic" : {
               "logs" : [
               "Une journée entière sans nourriture? ::soupir::", 
               "Je voudrais avoir quelque chose à manger.",
               "Aller toute une journée sans nourriture me rend tellement, tellement triste."
               ]
            },
            "beleaguered_leader" : {
               "logs" : [
               "C'est juste 24 heures sans nourriture. Ne paniquer pas.", 
               "La faim est bon pour se discipliner.", 
               "Je vais rêver de nourriture cette nuit.",
               "Une journée entière sans nourriture? Ne te plein pas; tu dois être un bon exemple."
               ]
            },
            "hopeless_optimist" : {
               "logs" : [
               "Wow, Je n'ai pas mangé depuis 24 heures!",
               "Toujours pas de nourriture à minuit? Dans ce cas je vais boire le clair de lune.",
               "J'ai tellement faim... Peut-être que demain nous trouverons des baies."
               ]
            },
            "lovable_rogue" : {
               "logs" : [
               "24 heures sans nourritures? J'étais sur d'avoir une opportunité en venant ici, si seulement je n'avais pas si faim.",
               "Personne n'as mangé depuis longtemps. Je pourrais gagner beaucoup d'argent si j'avais une tarte aux pommes de maman.",
               "Se passer de nourriture pendant une journée entière est étonnamment difficile."
               ]
            },
            "psychopathic_misanthrope" : {
               "logs" : [
               "Une journée entière sans nourriture? Mon estomac va commencer à se manger.",
               "Je viens d'une journée entière sans manger une seule chose que ce soit. Demain, mes 'amis' faites attention à vous.",
               "Je n'ai peut-être pas mangé pendant une journée mais je suis toujours un dur à cuire.",
               "Pas de nourriture dans le camp aujourd'hui, hein? Peut-être que je peux trouver quelque chose dans la forêt à tuer pour demain."
               ]
            },
            "insufferable_academic" : {
               "logs" : [
               "Le jeûne d'un jour m'offre simplement l'occasion d'observer les gémissement des mon esprit de singe.", 
               "Une journée sans nourriture est une excellent moyen d'aiguiser l'esprit.",
               "Selon mes recherches, les gens ont besoin de consommer au moins 24 unités d'énergie chaque jour pour maintenir un bon fonctionnement."
               ]
            },
            "diligent_sweetheart" : {
               "logs" : [
               "C'est bon , je n'ai pas besoin de mangé tout les jours.",
               "Une journée sans nourriture? À la maison, nous allions une semaine entière pour le festival de __teacher__", 
               "Par les préceptes de la grande Église, nous devrions manger au moins une fois par jour."
               ]
            }
         }
      }
   }
}
            